<?xml version="1.0"?>
<net name="Model7" version="11">
	<layers>
		<layer id="2" name="batched_images" type="Parameter" version="opset1">
			<data shape="?,?,?,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="batched_images">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="batched_points" type="Parameter" version="opset1">
			<data shape="?,?,?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="batched_points">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="batched_point_labels" type="Parameter" version="opset1">
			<data shape="?,?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="batched_point_labels">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="__module.mask_decoder/aten::unsqueeze/Unsqueeze_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 5, 256" offset="0" size="2560" />
			<output>
				<port id="0" precision="FP16" names="1084">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="__module.mask_decoder/aten::unsqueeze/Unsqueeze" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>5</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="47" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<output>
				<port id="0" precision="I32" names="47" />
			</output>
		</layer>
		<layer id="6" name="46" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2564" size="4" />
			<output>
				<port id="0" precision="I32" names="46" />
			</output>
		</layer>
		<layer id="7" name="aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="48,53">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_177558" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1" offset="2568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="aten::ge/GreaterEqual" type="GreaterEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="50">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_177559" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1" offset="2576" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="55">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="aten::div/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="aten::size/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="16" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2564" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="16" />
			</output>
		</layer>
		<layer id="15" name="aten::size/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="16" name="aten::size/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="17,19,20" />
			</output>
		</layer>
		<layer id="17" name="aten::div/Convert_1" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="18" name="aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="56">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="57_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2584" size="2" />
			<output>
				<port id="0" precision="FP16" names="57" />
			</output>
		</layer>
		<layer id="20" name="57" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="21" name="aten::where/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="58">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="73" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2586" size="4" />
			<output>
				<port id="0" precision="I32" names="73" />
			</output>
		</layer>
		<layer id="23" name="Unsqueeze_128361" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="60" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2590" size="4" />
			<output>
				<port id="0" precision="I32" names="60" />
			</output>
		</layer>
		<layer id="25" name="59" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2564" size="4" />
			<output>
				<port id="0" precision="I32" names="59" />
			</output>
		</layer>
		<layer id="26" name="aten::select/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="61,66">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_177560" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1" offset="2568" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="aten::ge/GreaterEqual_1" type="GreaterEqual" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="63">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_177561" type="Const" version="opset1">
			<data element_type="i64" shape="1, 1, 1" offset="2576" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="68">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="aten::div/Convert_2" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="11" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2594" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="11" />
			</output>
		</layer>
		<layer id="33" name="aten::size/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="aten::size/Gather_1" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="12,14,15" />
			</output>
		</layer>
		<layer id="35" name="aten::div/Convert_3" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I32" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="36" name="aten::div/Divide_1" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
			</input>
			<output>
				<port id="2" precision="FP32" names="69">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="70_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2584" size="2" />
			<output>
				<port id="0" precision="FP16" names="70" />
			</output>
		</layer>
		<layer id="38" name="70" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="aten::where/Select_1" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="71">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Unsqueeze_128362" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="aten::stack" type="Concat" version="opset1">
			<data axis="-1" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="74,input.151">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="aten::pad/ConvertLike" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Unsqueeze_131468" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Unsqueeze_131469" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Unsqueeze_131470" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="75" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2598" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="75" />
			</output>
		</layer>
		<layer id="47" name="aten::size/ShapeOf_3" type="ShapeOf" version="opset3">
			<data output_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="43" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2594" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="43" />
			</output>
		</layer>
		<layer id="49" name="aten::size/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="50" name="aten::size/Gather_2" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="44" />
			</output>
		</layer>
		<layer id="51" name="aten::rsub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="77,78,88,89" />
			</output>
		</layer>
		<layer id="52" name="Constant_131467" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="53" name="Unsqueeze_131471" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Concat_131472" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="aten::pad/Range" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2602" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_131481" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="57" name="aten::pad/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="aten::pad/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="aten::pad/ConvertLike_9" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="aten::pad/Range_4" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2610" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_131499" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="62" name="aten::pad/Gather_5" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="aten::pad/Concat_10" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="aten::pad/ConvertLike_11_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="2584" size="2" />
			<output>
				<port id="0" precision="FP16" />
			</output>
		</layer>
		<layer id="65" name="aten::pad/ConvertLike_11" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16" />
			</input>
			<output>
				<port id="1" precision="FP32" />
			</output>
		</layer>
		<layer id="66" name="aten::pad" type="Pad" version="opset1">
			<data pad_mode="constant" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
				<port id="2" precision="I32">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32" />
			</input>
			<output>
				<port id="4" precision="FP32" names="85,rescaled_batched_points">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="31" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="31" />
			</output>
		</layer>
		<layer id="68" name="aten::size/Constant_3" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="69" name="aten::size/Gather_3" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="32,34,35,36" />
			</output>
		</layer>
		<layer id="70" name="37" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2590" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" names="37" />
			</output>
		</layer>
		<layer id="71" name="aten::size/Constant_4" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="72" name="aten::size/Gather_4" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I32" names="38,40,41,42" />
			</output>
		</layer>
		<layer id="73" name="aten::mul/Multiply_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I32" />
			</input>
			<output>
				<port id="2" precision="I32" names="101,102,95,96" />
			</output>
		</layer>
		<layer id="74" name="Constant_151327" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2618" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="prim::ListConstruct/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="prim::ListConstruct/Reshape_0" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2598" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2594" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="prim::ListConstruct/Concat" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="I32" names="99">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="aten::reshape/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="100,points">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_177562_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1, 1" offset="2626" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_177562" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.prompt_encoder/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="924,coords_input">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_151330" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2618" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="GatherAssign_121363/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_139990" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2568" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="86" name="GatherAssign_121363/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="GatherAssign_121363/ReduceProd" type="ReduceProd" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="88" name="Constant_139991" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2628" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="89" name="GatherAssign_121363/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="GatherAssign_121363/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.prompt_encoder/aten::slice/Unsqueeze" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.prompt_encoder/aten::slice/Unsqueeze_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2636" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.prompt_encoder/aten::slice/Unsqueeze_2" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2590" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="GatherAssign_121363/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_173901" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Constant_173904" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2644" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_173907" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2660" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="GatherAssign_121363/Slice_0" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="910" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2560" size="4" />
			<output>
				<port id="0" precision="I32" names="910" />
			</output>
		</layer>
		<layer id="100" name="908" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2594" size="4" />
			<output>
				<port id="0" precision="I32" names="908" />
			</output>
		</layer>
		<layer id="101" name="GatherAssign_121363/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_139993" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2668" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="GatherAssign_121363/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.prompt_encoder/aten::slice/Unsqueeze_8" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.prompt_encoder/aten::slice/Unsqueeze_9" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2636" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.prompt_encoder/aten::slice/Unsqueeze_10" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2590" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.prompt_encoder/aten::slice/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="926,930_1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_173914" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_173917" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2644" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_173920" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2660" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.prompt_encoder/aten::slice/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32" names="927,931_1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.prompt_encoder/aten::select/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="928,932_1">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_177563_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 1" offset="2684" size="2" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_177563" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.prompt_encoder/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="929">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.prompt_encoder/aten::copy_/ConvertLike" type="ConvertLike" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.prompt_encoder/aten::copy_/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.prompt_encoder/aten::copy_/Broadcast" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="932">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_151331" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2618" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="GatherAssign_121363/Reshape_3" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="GatherAssign_121363/ScatterNDUpdate" type="ScatterNDUpdate" version="opset4">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="GatherAssign_121363/Reshape_4" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="925_1">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_151332" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2618" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="GatherAssign_121397/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_140049" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2568" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="126" name="GatherAssign_121397/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="GatherAssign_121397/ReduceProd" type="ReduceProd" version="opset1">
			<data keep_dims="false" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" />
			</output>
		</layer>
		<layer id="128" name="Constant_140050" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="2628" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="129" name="GatherAssign_121397/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="GatherAssign_121397/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="__module.prompt_encoder/aten::slice/Unsqueeze_16" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2560" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="__module.prompt_encoder/aten::slice/Unsqueeze_17" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="2636" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="__module.prompt_encoder/aten::slice/Unsqueeze_18" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="2590" size="4" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="GatherAssign_121397/Slice" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="Constant_173927" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2568" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Constant_173930" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2644" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="Constant_173933" type="Const" version="opset1">
			<data element_type="i32" shape="2" offset="2660" size="8" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="GatherAssign_121397/Slice_0" type="StridedSlice" version="opset1">
			<data begin_mask="1, 0" end_mask="1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
				<port id="3" precision="I32">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="912" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="2590" size="4" />
			<output>
				<port id="0" precision="I32" names="912" />
			</output>
		</layer>
		<layer id="140" name="GatherAssign_121397/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I32" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>-1</dim>
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Constant_140052" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="2668" size="16" />
			<rt_info>
				<attribute name="precise" version="0" />
			</rt_info>
			<output>
				<port id="0" precision="I64">
